wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_rspdif.h
/*!
    \file    gd32h77x_rspdif.h
    \brief   definitions for the RSPDIF
    
    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_RSPDIF_H
#define GD32H77X_RSPDIF_H

#include "gd32h77x.h"

/* RSPDIF definitions */
#define RSPDIF                      RSPDIF_BASE                                     /*!< RSPDIF base address */

/* registers definitions */
#define RSPDIF_CTL                  REG32(RSPDIF + 0x00000000U)                     /*!< RSPDIF control register */
#define RSPDIF_INTEN                REG32(RSPDIF + 0x00000004U)                     /*!< RSPDIF interrupt enable register */
#define RSPDIF_STAT                 REG32(RSPDIF + 0x00000008U)                     /*!< RSPDIF status register */
#define RSPDIF_STATC                REG32(RSPDIF + 0x0000000CU)                     /*!< RSPDIF status flag clear register */
#define RSPDIF_DATA                 REG32(RSPDIF + 0x00000010U)                     /*!< RSPDIF RX data register */
#define RSPDIF_CHSTAT               REG32(RSPDIF + 0x00000014U)                     /*!< RSPDIF RX channel status register */
#define RSPDIF_DTH                  REG32(RSPDIF + 0x00000018U)                     /*!< RSPDIF RX data threshold register */

#define RSPDIF_DATA_F0              REG32(RSPDIF + 0x00000010U)                     /*!< RSPDIF RX data register fomat 0 */
#define RSPDIF_DATA_F1              REG32(RSPDIF + 0x00000010U)                     /*!< RSPDIF RX data register fomat 1 */
#define RSPDIF_DATA_F2              REG32(RSPDIF + 0x00000010U)                     /*!< RSPDIF RX data register fomat 2 */

/* bits definitions */
/* RSPDIF_CTL */
#define RSPDIF_CTL_RXCFG            BITS(0,1)                                       /*!< RSPDIF configuration */
#define RSPDIF_CTL_DMAREN           BIT(2)                                          /*!< RSPDIF receiver DMA enable for data flow */
#define RSPDIF_CTL_RXSTEOMEN        BIT(3)                                          /*!< RSPDIF RX stereo mode enable */
#define RSPDIF_CTL_RXDF             BITS(4,5)                                       /*!< RSPDIF RX data format selection */
#define RSPDIF_CTL_PNCPEN           BIT(6)                                          /*!< RSPDIF parity error bit no copy enable bit */
#define RSPDIF_CTL_VNCPEN           BIT(7)                                          /*!< RSPDIF validity bit no copy enable bit */
#define RSPDIF_CTL_CUNCPEN          BIT(8)                                          /*!< RSPDIF channel status and user bits no copy enable bit */
#define RSPDIF_CTL_PTNCPEN          BIT(9)                                          /*!< RSPDIF preamble type bits no copy enable bit */
#define RSPDIF_CTL_DMACBEN          BIT(10)                                         /*!< RSPDIF control buffer DMA enable for control flow */
#define RSPDIF_CTL_CFCHSEL          BIT(11)                                         /*!< RSPDIF the control flow acquires channel state source selection */
#define RSPDIF_CTL_MAXRT            BITS(12,13)                                     /*!< RSPDIF maximum number of retries allowed during the RSPDIF synchronization phase */
#define RSPDIF_CTL_WFRXA            BIT(14)                                         /*!< RSPDIF wait for the four valid transition signal of the selected RSPDIF channel */
#define RSPDIF_CTL_RXCHSEL          BITS(16,18)                                     /*!< RSPDIF input channel selection */
#define RSPDIF_CTL_SCKEN            BIT(20)                                         /*!< RSPDIF symbol clock enable */
#define RSPDIF_CTL_BKSCKEN          BIT(21)                                         /*!< RSPDIF backup symbol clock enable */

/* RSPDIF_INTEN */
#define RSPDIF_INTEN_RBNEIE         BIT(0)                                          /*!< RSPDIF_DATA register no empty interrupt enable */
#define RSPDIF_INTEN_CBNEIE         BIT(1)                                          /*!< RSPDIF_CHSTAT register no empty interrupt enable */
#define RSPDIF_INTEN_PERRIE         BIT(2)                                          /*!< RSPDIF parity error interrupt enable */
#define RSPDIF_INTEN_RXORERRIE      BIT(3)                                          /*!< RSPDIF RX overrun error interrupt enable */
#define RSPDIF_INTEN_SYNDBIE        BIT(4)                                          /*!< RSPDIF synchronization block detected interrupt enable */
#define RSPDIF_INTEN_SYNDOIE        BIT(5)                                          /*!< RSPDIF synchronization done interrupt enable */
#define RSPDIF_INTEN_RXDCERRIE      BIT(6)                                          /*!< RSPDIF data decoding error interrupt enable */

