wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_rspdif.h
/* RSPDIF_STAT */
#define RSPDIF_STAT_RBNE            BIT(0)                                          /*!< RSPDIF_DATA register is not empty */
#define RSPDIF_STAT_CBNE            BIT(1)                                          /*!< RSPDIF_CHSTAT control buffer is not empty */
#define RSPDIF_STAT_PERR            BIT(2)                                          /*!< RSPDIF parity error */
#define RSPDIF_STAT_RXORERR         BIT(3)                                          /*!< RSPDIF RX overrun error */
#define RSPDIF_STAT_SYNDB           BIT(4)                                          /*!< RSPDIF synchronization block detected */
#define RSPDIF_STAT_SYNDO           BIT(5)                                          /*!< RSPDIF synchronization done */
#define RSPDIF_STAT_FRERR           BIT(6)                                          /*!< RSPDIF frame error */
#define RSPDIF_STAT_SYNERR          BIT(7)                                          /*!< RSPDIF synchronization error */
#define RSPDIF_STAT_TMOUTERR        BIT(8)                                          /*!< RSPDIF timeout error */
#define RSPDIF_STAT_CKCNT5          BITS(16,30)                                     /*!< the number of consecutive time clock cycles */

/* RSPDIF_STATC */
#define RSPDIF_STATC_PERRC          BIT(2)                                          /*!< RSPDIF clears the parity error flag */
#define RSPDIF_STATC_RXORERRC       BIT(3)                                          /*!< RSPDIF clears the RX overrun error flag */
#define RSPDIF_STATC_SYNDBC         BIT(4)                                          /*!< RSPDIF clears the synchronization block detected flag  */
#define RSPDIF_STATC_SYNDOC         BIT(5)                                          /*!< RSPDIF clears the synchronization done flag  */

/* RSPDIF_DATA */
/* RSPDIF_DATA_F0 */
#define RSPDIF_DATA_F0_DATA0        BITS(0,23)                                      /*!< data value */
#define RSPDIF_DATA_F0_P            BIT(24)                                         /*!< parity error bit */
#define RSPDIF_DATA_F0_V            BIT(25)                                         /*!< validity bit */
#define RSPDIF_DATA_F0_U            BIT(26)                                         /*!< user bit */
#define RSPDIF_DATA_F0_C            BIT(27)                                         /*!< channel status bit */
#define RSPDIF_DATA_F0_PREF         BITS(28,29)                                     /*!< preamble type */

/* RSPDIF_DATA_F1 */
#define RSPDIF_DATA_F1_P            BIT(0)                                          /*!< parity error bit */
#define RSPDIF_DATA_F1_V            BIT(1)                                          /*!< validity bit */
#define RSPDIF_DATA_F1_U            BIT(2)                                          /*!< user bit */
#define RSPDIF_DATA_F1_C            BIT(3)                                          /*!< channel status bit */
#define RSPDIF_DATA_F1_PREF         BITS(4,5)                                       /*!< preamble type */
#define RSPDIF_DATA_F1_DATA0        BITS(8,31)                                      /*!< data value */

/* RSPDIF_DATA_F2 */
#define RSPDIF_DATA_F2_DATA1        BITS(0,15)                                      /*!< steo mode: this field contains the channel B data\
                                                                                    mono mode: this field contains the more recent value */
#define RSPDIF_DATA_F2_DATA2        BITS(16,31)                                     /*!< steo mode: this field contains the channel A data\
                                                                                    mono mode: this field contains the oldest value */

/* RSPDIF_CHSTAT */
#define RSPDIF_CHSTAT_USER          BITS(0,15)                                      /*!< user data information */
#define RSPDIF_CHSTAT_CHS           BITS(16,23)                                     /*!< channel A status information */
#define RSPDIF_CHSTAT_SOB           BIT(24)                                         /*!< start of block */

/* RSPDIF_DTH */
#define RSPDIF_DTH_THHI             BITS(0,12)                                      /*!< high threshold */
#define RSPDIF_DTH_THLO             BITS(16,28)                                     /*!< low threshold */

/* constants definitions */
/* RSPDIF initialization parameter structure definitions */
typedef struct {
    uint32_t input_sel;                                                             /*!< the RSPDIF input selection */
    uint32_t max_retrie;                                                            /*!< the RSPDIF maximum allowed re-tries during synchronization phase */
    uint32_t wait_activity;                                                         /*!< the RSPDIF wait for activity on the selected input */
    uint32_t channel_sel;                                                           /*!< whether swapping the channel status from channel A or B */
    uint32_t sample_format;                                                         /*!< the RSPDIF data samples format (LSB, MSB, ...) */
    uint32_t sound_mode;                                                            /*!< the RSPDIF is in stereo or mono mode */
    uint32_t pre_type;                                                              /*!< whether opy the preamble type value into the RSPDIF_DATA */
    uint32_t channel_status_bit;                                                    /*!< whether the channel status and user bits are copied or not into the received frame */
    uint32_t validity_bit;                                                          /*!< whether the validity bit is copied or not into the received frame */
    uint32_t parity_error_bit;                                                      /*!< whether the parity error bit is copied or not into the received frame */
    uint32_t symbol_clk;                                                            /*!< the RSPDIF symbol clock generation */
    uint32_t bak_symbol_clk;                                                        /*!< the RSPDIF backup symbol clock generation */
} rspdif_parameter_struct;

