wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_rspdif.h
/* RSPDIF data parameter structure definitions */
typedef struct {
    uint32_t format;                                                                /*!< the data dormat */
    uint32_t preamble;                                                              /*!< the preamble type */
    uint32_t channel_status;                                                        /*!< channel status bit */
    uint32_t user_bit;                                                              /*!< user bit */
    uint32_t validity;                                                              /*!< validity bit */
    uint32_t parity_err;                                                            /*!< parity error bit */
    uint32_t data0;                                                                 /*!< data value 0 */
    uint32_t data1;                                                                 /*!< data value 1 */
} rspdif_data_struct;

/* define the RSPDIF bit position and its register index offset */
#define RSPDIF_REG_VAL(offset)              REG32((RSPDIF) + (((uint32_t)(offset) & 0x0000FFFFU) >> 6))
#define RSPDIF_BIT_POS(val)                 ((uint32_t)(val) & 0x0000001FU)
#define RSPDIF_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2) \
                                            (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16) | \
                                            (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define RSPDIF_REG_VAL2(offset)             REG32((RSPDIF) + ((uint32_t)(offset) >> 22))
#define RSPDIF_BIT_POS2(val)                (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define RSPDIF_CTL_REG_OFFSET               ((uint32_t)0x00000000U)                 /*!< CTL register offset */
#define RSPDIF_STAT_REG_OFFSET              ((uint32_t)0x00000008U)                 /*!< STAT register offset */

/* RSPDIF interrupt flags */
typedef enum {
    RSPDIF_INT_FLAG_RBNE     = RSPDIF_REGIDX_BIT2(RSPDIF_CTL_REG_OFFSET, 0U, RSPDIF_STAT_REG_OFFSET, 0U),  /*!< RSPDIF RX buffer is not empty interrupt flag */
    RSPDIF_INT_FLAG_CBNE     = RSPDIF_REGIDX_BIT2(RSPDIF_CTL_REG_OFFSET, 1U, RSPDIF_STAT_REG_OFFSET, 1U),  /*!< RSPDIF RX control buffer is not empty interrupt flag */
    RSPDIF_INT_FLAG_PERR     = RSPDIF_REGIDX_BIT2(RSPDIF_CTL_REG_OFFSET, 2U, RSPDIF_STAT_REG_OFFSET, 2U),  /*!< RSPDIF parity error interrupt flag */
    RSPDIF_INT_FLAG_RXORERR  = RSPDIF_REGIDX_BIT2(RSPDIF_CTL_REG_OFFSET, 3U, RSPDIF_STAT_REG_OFFSET, 3U),  /*!< RSPDIF RX overrun error interrupt flag */
    RSPDIF_INT_FLAG_SYNDB    = RSPDIF_REGIDX_BIT2(RSPDIF_CTL_REG_OFFSET, 4U, RSPDIF_STAT_REG_OFFSET, 4U),  /*!< RSPDIF synchronization block detected interrupt flag */
    RSPDIF_INT_FLAG_SYNDO    = RSPDIF_REGIDX_BIT2(RSPDIF_CTL_REG_OFFSET, 5U, RSPDIF_STAT_REG_OFFSET, 5U),  /*!< RSPDIF synchronization done interrupt flag */
    RSPDIF_INT_FLAG_FRERR    = RSPDIF_REGIDX_BIT2(RSPDIF_CTL_REG_OFFSET, 6U, RSPDIF_STAT_REG_OFFSET, 6U),  /*!< RSPDIF frame error interrupt flag */
    RSPDIF_INT_FLAG_SYNERR   = RSPDIF_REGIDX_BIT2(RSPDIF_CTL_REG_OFFSET, 6U, RSPDIF_STAT_REG_OFFSET, 7U),  /*!< RSPDIF synchronization error interrupt flag */
    RSPDIF_INT_FLAG_TMOUTERR = RSPDIF_REGIDX_BIT2(RSPDIF_CTL_REG_OFFSET, 6U, RSPDIF_STAT_REG_OFFSET, 8U)   /*!< RSPDIF time out error interrupt flag */
} rspdif_interrupt_flag_enum;

/* RSPDIF configuration */
#define CTL_RXCFG(regval)                   (BITS(0,1) & ((uint32_t)(regval)))
#define RSPDIF_STATE_IDLE                   CTL_RXCFG(0)                            /*!< disable RSPDIF */
#define RSPDIF_STATE_SYNC                   CTL_RXCFG(1)                            /*!< enable RSPDIF synchronization only */
#define RSPDIF_STATE_RCV                    CTL_RXCFG(3)                            /*!< enable RSPDIF */

/* RX stereo mode enable */
#define RSPDIF_STEREOMODE_DISABLE           ((uint32_t)0x00000000U)                 /*!< MONO mode */
#define RSPDIF_STEREOMODE_ENABLE            ((uint32_t)RSPDIF_CTL_RXSTEOMEN)        /*!< STEREO mode */

/* RX data format selection */
#define CTL_RXDF(regval)                    (BITS(4,5) & ((uint32_t)(regval) << 4))
#define RSPDIF_DATAFORMAT_LSB               CTL_RXDF(0)                             /*!< the data format is described in the RSPDIF_DATA_F0 register, audio data is right aligned (LSB) */
#define RSPDIF_DATAFORMAT_MSB               CTL_RXDF(1)                             /*!< the data format is described in the RSPDIF_DATA_F1 register, audio data is left aligned (MSB) */
#define RSPDIF_DATAFORMAT_32BITS            CTL_RXDF(2)                             /*!< the data format is described in the RSPDIF_DATA_F2 register, which packs two 16-bit audio data into one 32-bit data */

/* whether copy preamble type bit into RSPDIF_DATA */
#define RSPDIF_PREAMBLE_TYPE_MASK_OFF       ((uint32_t)0x00000000U)                 /*!< copy the preamble type bit into the RSPDIF_DATA */
#define RSPDIF_PREAMBLE_TYPE_MASK_ON        ((uint32_t)RSPDIF_CTL_PTNCPEN)          /*!< do not copy the preamble type bit into the RSPDIF_DATA, but write 0 instead */

/* whether copy channel status and user bits into RSPDIF_DATA */
#define RSPDIF_CHANNEL_STATUS_MASK_OFF      ((uint32_t)0x00000000U)                 /*!< copy the channel status and user bit into the RSPDIF_DATA */
#define RSPDIF_CHANNEL_STATUS_MASK_ON       ((uint32_t)RSPDIF_CTL_CUNCPEN)          /*!< do not copy the channel status and user bit into the RSPDIF_DATA, but write 0 instead */

/* whether copy validity bit into RSPDIF_DATA */
#define RSPDIF_VALIDITY_MASK_OFF            ((uint32_t)0x00000000U)                 /*!< copy the validity bit into the RSPDIF_DATA */
#define RSPDIF_VALIDITY_MASK_ON             ((uint32_t)RSPDIF_CTL_VNCPEN)           /*!< do not copy the validity bit into the RSPDIF_DATA, but write 0 instead */

/* whether copy parity error bit into RSPDIF_DATA */
#define RSPDIF_PERROR_MASK_OFF              ((uint32_t)0x00000000U)                 /*!< copy the parity error bit into the RSPDIF_DATA */
#define RSPDIF_PERROR_MASK_ON               ((uint32_t)RSPDIF_CTL_PNCPEN)           /*!< do not copy the parity error bit into the RSPDIF_DATA, but write 0 instead */

