wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_rspdif.h
/* maximum number of retries allowed during the RSPDIF synchronization */
#define CTL_MAXRT(regval)                   (BITS(12,13) & ((uint32_t)(regval) << 12))
#define RSPDIF_MAXRETRIES_NONE              CTL_MAXRT(0)                           /*!< no retry */
#define RSPDIF_MAXRETRIES_3                 CTL_MAXRT(1)                           /*!< allow up to 3 retries */
#define RSPDIF_MAXRETRIES_15                CTL_MAXRT(2)                           /*!< allow up to 15 retries */
#define RSPDIF_MAXRETRIES_63                CTL_MAXRT(3)                           /*!< allow up to 63 retries */

/* wait for the four valid transition signal of the selected RSPDIF channel */
#define RSPDIF_WAIT_FOR_ACTIVITY_OFF        ((uint32_t)0x00000000U)                 /*!< RSPDIF does not wait for the valid conversion signal from the selected RSPDIF channel */
#define RSPDIF_WAIT_FOR_ACTIVITY_ON         ((uint32_t)RSPDIF_CTL_WFRXA)            /*!< RSPDIF wait for the valid conversion signal from the selected RSPDIF channel */

/* input channel selection */
#define CTL_RXCHSEL(regval)                 (BITS(16,18) & ((uint32_t)(regval) << 16))
#define RSPDIF_INPUT_IN0                    CTL_RXCHSEL(0)                          /*!< RSPDIF_CH0 selected */
#define RSPDIF_INPUT_IN1                    CTL_RXCHSEL(1)                          /*!< RSPDIF_CH1 selected */
#define RSPDIF_INPUT_IN2                    CTL_RXCHSEL(2)                          /*!< RSPDIF_CH2 selected */
#define RSPDIF_INPUT_IN3                    CTL_RXCHSEL(3)                          /*!< RSPDIF_CH3 selected */

/* symbol clock enable */
#define RSPDIF_SYMBOL_CLK_OFF               ((uint32_t)0x00000000U)                 /*!< the RSPDIF does not generate a symbol clock */
#define RSPDIF_SYMBOL_CLK_ON                RSPDIF_CTL_SCKEN                        /*!< the RSPDIF generates a symbol clock */

/* backup symbol clock enable */
#define RSPDIF_BACKUP_SYMBOL_CLK_OFF        ((uint32_t)0x00000000U)                 /*!< the RSPDIF does not generate a backup symbol clock */
#define RSPDIF_BACKUP_SYMBOL_CLK_ON         RSPDIF_CTL_BKSCKEN                      /*!< the RSPDIF generates a backup symbol clock if SCKEN = 1 */

/* the control flow acquires channel state source selection */
#define RSPDIF_CHANNEL_A                    ((uint32_t)0x00000000U)                 /*!< gets channel status from channel A */
#define RSPDIF_CHANNEL_B                    ((uint32_t)RSPDIF_CTL_CFCHSEL)          /*!< gets channel status from channel B */

/* RSPDIF preamble type */
#define RSPDIF_PREAMBLE_NONE                ((uint32_t)0x00000000U)                 /*!< RSPDIF preamble received not used */
#define RSPDIF_PREAMBLE_B                   ((uint32_t)0x00000001U)                 /*!< RSPDIF Preamble B received */
#define RSPDIF_PREAMBLE_M                   ((uint32_t)0x00000002U)                 /*!< RSPDIF Preamble M received */
#define RSPDIF_PREAMBLE_W                   ((uint32_t)0x00000003U)                 /*!< RSPDIF Preamble W received */

/* RSPDIF interrupt enable or disable constants definitions */
#define RSPDIF_INT_RBNE                     RSPDIF_INTEN_RBNEIE                     /*!< RSPDIF RX buffer no empty interrupt enable */
#define RSPDIF_INT_CBNE                     RSPDIF_INTEN_CBNEIE                     /*!< RSPDIF RX control buffer no empty interrupt enable */
#define RSPDIF_INT_PERR                     RSPDIF_INTEN_PERRIE                     /*!< RSPDIF parity error interrupt enable */
#define RSPDIF_INT_RXORERR                  RSPDIF_INTEN_RXORERRIE                  /*!< RSPDIF RX overrun error interrupt enable */
#define RSPDIF_INT_SYNDB                    RSPDIF_INTEN_SYNDBIE                    /*!< RSPDIF synchronization block detected interrupt enable */
#define RSPDIF_INT_SYNDO                    RSPDIF_INTEN_SYNDOIE                    /*!< RSPDIF synchronization done interrupt enable */
#define RSPDIF_INT_RXDCERR                  RSPDIF_INTEN_RXDCERRIE                  /*!< RSPDIF data decoding error interrupt enable */

/* RSPDIF flags */
#define RSPDIF_FLAG_RBNE                    RSPDIF_STAT_RBNE                        /*!< RSPDIF RX buffer is not empty */
#define RSPDIF_FLAG_CBNE                    RSPDIF_STAT_CBNE                        /*!< RSPDIF RX control buffer is not empty */
#define RSPDIF_FLAG_PERR                    RSPDIF_STAT_PERR                        /*!< RSPDIF parity error */
#define RSPDIF_FLAG_RXORERR                 RSPDIF_STAT_RXORERR                     /*!< RSPDIF RX overrun error */
#define RSPDIF_FLAG_SYNDB                   RSPDIF_STAT_SYNDB                       /*!< RSPDIF synchronization block detected */
#define RSPDIF_FLAG_SYNDO                   RSPDIF_STAT_SYNDO                       /*!< RSPDIF synchronization done */
#define RSPDIF_FLAG_FRERR                   RSPDIF_STAT_FRERR                       /*!< RSPDIF frame error */
#define RSPDIF_FLAG_SYNERR                  RSPDIF_STAT_SYNERR                      /*!< RSPDIF synchronization error */
#define RSPDIF_FLAG_TMOUTERR                RSPDIF_STAT_TMOUTERR                    /*!< RSPDIF time out error */

/* function declarations */
/* RSPDIF deinitialization and initialization functions */
/* reset the RSPDIF */
void rspdif_deinit(void);
/* initialize the parameters of RSPDIF structure with the default values */
void rspdif_struct_para_init(rspdif_parameter_struct *rspdif_struct);
/* initialize the RSPDIF parameters */
void rspdif_init(rspdif_parameter_struct *rspdif_struct);
/* specifies the RSPDIF peripheral state */
void rspdif_enable(uint32_t mode);
/* disable RSPDIF */
void rspdif_disable(void);

/* symbol clock functions */
/* enable RSPDIF symbol clock */
void rspdif_symbol_clock_enable(void);
/* disable RSPDIF symbol clock */
void rspdif_symbol_clock_disable(void);
/* enable RSPDIF backup symbol clock */
void rspdif_backup_symbol_clock_enable(void);
/* disable RSPDIF backup symbol clock */
void rspdif_backup_symbol_clock_disable(void);

/* DMA functions */
/* enable the RSPDIF receiver DMA */
void rspdif_dma_enable(void);
/* disable the RSPDIF receiver DMA */
void rspdif_dma_disable(void);
/* enable the RSPDIF control buffer DMA */
void rspdif_control_buffer_dma_enable(void);
/* disable the RSPDIF control buffer DMA */
void rspdif_control_buffer_dma_disable(void);

/* transfer function */
/* RSPDIF read data */
void rspdif_data_read(rspdif_data_struct *data_struct);

/* information acquisition functions */
/* get duration of 5 symbols counted using rspdif_ck */
uint32_t rspdif_duration_of_symbols_get(void);
/* get user data information */
uint32_t rspdif_user_data_get(void);
/* get channel status information */
uint32_t rspdif_channel_status_get(void);
/* get start of block */
FlagStatus rspdif_start_block_status_get(void);
/* get threshold low estimation */
uint32_t rspdif_low_threshold_get(void);
/* get threshold high estimation */
uint32_t rspdif_high_threshold_get(void);

/* flag and interrupt functions */
/* get RSPDIF flag status */
FlagStatus rspdif_flag_get(uint32_t flag);
/* clear RSPDIF flag */
void rspdif_flag_clear(uint32_t flag);
/* enable RSPDIF interrupt */
void rspdif_interrupt_enable(uint32_t interrupt);
/* disable RSPDIF interrupt */
void rspdif_interrupt_disable(uint32_t interrupt);
/* get RSPDIF interrupt flag status */
FlagStatus rspdif_interrupt_flag_get(rspdif_interrupt_flag_enum int_flag);
/* clear RSPDIF interrupt flag status */
void rspdif_interrupt_flag_clear(rspdif_interrupt_flag_enum int_flag);

#endif /* GD32H77X_RSPDIF_H */
